Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/the_irish_education_system/constitution_and_education.html.txt.tmx
Source language: en
Languages: ga

source: The Constitution of Ireland has a number of articles that are relevant to the law on education
ga: Tá roinnt airteagal ag Bunreacht na hÉireann a bhaineann le dlí an oideachais

source: Article 42 of the Constitution deals with education
ga: Baineann Airteagal 42 den Bhunreacht leis an oideachas

source: Other articles also have a bearing on education law, in particular the articles dealing with the family and religion (Articles 41 and 44)
ga: Tá baint ag airteagail eile le dlí an oideachais - go háirid airteagail a bhaineann leis an teaghlach agus le creideamh (Airteagail 41 agus 44)

source: You can read the full text of the Irish Constitution
ga: Is féidir téacs iomlán Bhunreacht na hÉireann a léamh

source: This is the text of Article 42 of the Constitution of Ireland:
ga: Seo a leanas téacs Airteagail 42 de Bhunreacht na hÉireann:

source: "1: The State acknowledges that the primary and natural educator of the child is the Family and guarantees to respect the inalienable right and duty of parents to provide, according to their means, for the religious and moral, intellectual, physical and social education of their children
ga: 1: Admhaíonn an Stát gurb é an Teaghlach is múinteoir príomha dúchasach don leanbh, agus ráthaíonn gan cur isteach ar cheart doshannta ná ar dhualgas doshannta tuistí chun oideachas de réir a n-acmhainne a chur ar fáil dá gclainn i gcúrsaí creidimh, moráltachta, intleachta, coirp agus comhdhaonnachta

source: 2: Parents shall be free to provide this education in their homes or in private schools or in schools recognised or established by the State
ga: 2: Tig le tuistí an t-oideachas sin a chur ar fáil dá gclainn ag baile nó i scoileanna príobháideacha nó i scoileanna a admhaítear nó a bhunaítear ag an Stát

source: 3.1°:The State shall not oblige parents in violation of their conscience and lawful preference to send their children to schools established by the State, or to any particular type of school designated by the State
ga: 3.1°: Ní cead don Stát a chur d'fhiacha ar thuistí, in aghaidh a gcoinsiasa nó a rogha dleathaí, a gclann a chur ar scoileanna a bhunaítear ag an Stát nó ar aon chineál áirithe scoile a ainmnítear ag an Stát

source: 3.2°:The State shall, however, as guardian of the common good, require in view of actual conditions that the children receive a certain minimum education, moral, intellectual and social
ga: 3.2°: Ach ós é an Stát caomhnóir leasa an phobail ní foláir dó, toisc cor an lae, é a dhéanamh éigeantach minimum áirithe oideachais a thabhairt do na leanaí i gcúrsaí moráltachta, intleachta agus comhdhaonnachta

source: 4:The State shall provide for free primary education and shall endeavour to supplement and give reasonable aid to private and corporate educational initiative, and, when the public good requires it, provide other educational facilities or institutions with due regard, however, for the rights of parents, especially in the matter of religious and moral formation."
ga: 4: Ní foláir don Stát socrú a dhéanamh chun bunoideachas a bheith ar fáil in aisce, agus iarracht a dhéanamh chun cabhrú go réasúnta agus chun cur le tionscnamh oideachais idir phríobháideach agus chumannta agus, nuair is riachtanas chun leasa an phobail é, áiseanna nó fundúireachtaí eile oideachais a chur ar fáil, ag féachaint go cuí, áfach, do chearta tuistí, go mór mór maidir le múnlú na haigne i gcúrsaí creidimh is moráltachta

source: This is the relevant part of Article 41:
ga: Seo a leanas an chuid chuí de Airteagal 41:

source: "1.1°: The State recognises the Family as the natural primary and fundamental unit group of Society, and as a moral institution possessing inalienable and imprescriptible rights, antecedent and superior to all positive law
ga: 1.1°: Admhaíonn an Stát gurb é an Teaghlach is buíon-aonad príomha bunaidh don chomhdhaonnacht de réir nádúir, agus gur foras morálta é ag a bhfuil cearta doshannta dochloíte is ársa agus is airde ná aon reacht daonna

source: 1.2°: The State, therefore, guarantees to protect the Family in its constitution and authority, as the necessary basis of social order and as indispensable to the welfare of the Nation and the State."
ga: 1.2°: Ós é an Teaghlach is fotha riachtanach don ord chomhdhaonnach agus ós éigeantach é do leas an Náisiúin agus an Stáit, ráthaíonn an Stát comhshuíomh agus údarás an Teaghlaigh a chaomhnú

source: What these articles mean
ga: Céard is brí leis na hairteagail seo

source: These articles have been the subject of a number of court decisions
ga: Déanadh roinnt cinnithe cúirte bunaithe ar na hairteagail seo

source: In simple terms, the essential points about these articles are:
ga: Go simplí, seo a leanas príomhphointí na n-airteagal:

source: • The family is the main source of education for the child
ga: • Is é an teaghlach príomhfhoinse oideachais don pháiste

source: Parents are entitled to provide education outside the school system if they wish
ga: Tá sé de cheart ag tuismitheoirí oideachas a chur ar fáil dá gclann taobh amuigh den chóras scoile más mian leo

source: • The state may not force parents to send their children to any school or any particular kind of school
ga: • Ní féidir leis an Stát iachall a chur ar thuismitheoirí a gclann a chur chuig scoil faoi leith nó chuig cinéal faoi leith scoile

source: Parents may decide the school to which they wish to send their children but there is no constitutional obligation on a particular school to accept individual children
ga: Is féidir le tuismitheoirí scoil a roghnú dá gclann ach níl aon dualgas bunreachtúil ar an scoil glacadh le páiste faoi leith

source: • The state may require that the children receive a certain minimum education
ga: • Is féidir leis an Stát a éileamh go gcuirtear oideachas chuig leibhéal faoi leith ar fáil do pháistí

source: This certain minimum has not yet been defined in legislation or in official policy
ga: Níl an leibhéal faoi leith seo leagtha síos i reachtaíocht nó i bpolasaí oifigiúil fós

source: Many of the court cases have been about the precise meaning of that phrase
ga: Baineann cuid mhaith de na cásanna cúirte le míniú cruinn na n-abairtí sin

source: • The state is obliged to provide for free primary education
ga: • Tá dualgas ar an Stát bunoideachas a chur ar fáil saor in aisce

source: It is not obliged to provide that education directly
ga: Níl dualgas air an t-oideachas a chur ar fáil é féin go díreach

source: In practice, there are some state schools but the majority of primary schools are privately owned and largely state funded
ga: I ngníomh tá roinnt scoileanna Stáit ann ach tá formhór na mbunscoileanna in úinéireacht phríobháideach agus faigheann siad formhór a gcuid airgid ón Stát

source: • The state is not obliged to directly provide schools but it is not prevented from doing so either
ga: • Níl dualgas ar an Stát scoileanna a chur ar fáil go díreach ach níl aon chosc air é sin a dhéanamh ach an oiread

source: The Education (Welfare) Act 2000 does not give a definition of a "minimum education"
ga: Níl aon mhíniú ar "oideachas chuig leibhéal faoi leith" san Acht Oideachais (Leas) 2000

source: However, it does provide that the Minister may set out a "prescribed minimum education"
ga: Ach, deir sé gur féidir leis an Aire "oideachas chuig leibhéal faoi leith ceaptha" a leagan síos

source: That minimum standard may be different for children of different ages and of different capacities - including physical, mental and emotional capacities
ga: D'fhéadfadh sé go mbeadh an bunchaighdeán difriúil do pháistí d'aoiseanna difriúla agus le cumas difriúil - cumas fisiciúil, intinne agus tochtaigh san áireamh

source: The Act also provides that children educated outside the mainstream school system are to be identified and assessed in order to ensure that the education they are receiving meets the minimum standards
ga: Deir an tAcht nach mór páistí a bhfuil oideachas dhá chur orthu taobh amuigh den ghnáthchóras scoile a aithint agus meastóireacht a dhéanamh orthu le cinntiú go bhfuil an t-oideachas atá dhá fháil acu ag sásamh bunchaighdeáin

source: The register is maintained by the Child and Family Agency
ga: An Ghníomhaireacht um Leanaí agus an Teaghlach a choinneoidh an clár seo

source: In the Sinnott case, the Supreme Court decided that the right to free primary education ends at age 18 and does not continue on the basis of need
ga: Tá an cheist maidir le huasteorainn aoise do dhualgas an Stáit oideachas ag an mbunleibhéal a chur ar fáil saor in aisce ós comhair na Cúirte Uachtaraigh faoi láthair

source: This is the relevant part of Article 44:
ga: Seo a leanas an chuid chuí de Airteagal 44:

source: 2.2°: The State guarantees not to endow any religion
ga: 2.2°: Ráthaíonn an Stát gan aon chóras creidimh a mhaoiniú

source: 2.3°: The State shall not impose any disabilities or make any discrimination on the ground of religious profession, belief or status
ga: 2.3°: Ní cead don Stát neach a chur faoi mhíchumas ar bith ná aon idirdhealú a dhéanamh mar gheall ar chreideamh nó admháil chreidimh nó céim i gcúrsaí creidimh

source: 2.4°: Legislation providing State aid for schools shall not discriminate between schools under the management of different religious denominations, nor be such as to affect prejudicially the right of any child to attend a school receiving public money without attending religious instruction at that school
ga: 2.4°: Reachtaíocht lena gcuirtear cúnamh Stáit ar fáil do scoileanna ní cead idirdhealú a dhéanamh inti idir scoileanna atá faoi bhainistí aicmí creidimh seachas a chéile ná í do dhéanamh dochair do cheart aon linbh chun scoil a gheibheann airgead poiblí a fhreastal gan teagasc creidimh sa scoil sin a fhreastal

source: 2.5°: Every religious denomination shall have the right to manage its own affairs, own, acquire and administer property, movable and immovable, and maintain institutions for religious or charitable purposes
ga: 2.5°: Tá sé de cheart ag gach aicme chreidimh a ngnóthaí féin a bhainistí, agus maoin, idir shoaistrithe agus do-aistrithe, a bheith dá gcuid féin acu, agus í a fháil agus a riaradh, agus fundúireachtaí chun críocha creidimh is carthanachta a chothabháil

source: 2.6°: The property of any religious denomination or any educational institution shall not be diverted save for necessary works of public utility and on payment of compensation
ga: 2.6°: Ní cead maoin aon aicme creidimh ná aon fhundúireachtaí oideachais a bhaint díobh ach amháin le haghaidh oibreacha riachtanacha chun áise poiblí, agus sin tar éis cúiteamh a íoc leo

source: This article means that there may not be discrimination between the different denominations and that children have the right to attend state aided schools without attending religious instruction
ga: De réir an airteagail seo mar sin ní féidir idirdhealú a dhéanamh idir na haicmí creidimh eagsúla agus go bhfuil sé de cheart ag páistí freastal ar scoileanna atá maoinithe ag an Stát gan freastal ar ranganna creidimh

source: In practice, certain time periods may be set aside for religious instruction and the parents have a right to withdraw the child at these times
ga: I ngníomh, bíonn ranganna faoi leith i dteagasc creidimh agus tá sé de cheart ag tuismitheoirí páiste a thógáil ón scoil le linn an ama sin

source: However, the nature of the curriculum is such that there is not generally a rigid divide between subjects and the school ethos tends to pervade all subjects
ga: Ach, tá an curaclam amhlaidh nach bhfuil na hábhair scartha go huilig ón chéile agus tagann meon na scoile i gceist leis na hábhair ar fad

source: It has been argued that the article means that a child may not be refused access to a publicly funded school on the basis of the child's religious beliefs
ga: Tá sé ráite go bhfuil sé i gceist ag an airteagal nach féidir diúltú páiste a ghlacadh i scoil atá maoinithe ag an Stát ar bhunús an chreidimh atá ag an bpáiste

source: Educational establishments in Ireland are subject to the Equal Status Acts 2000-2011
ga: Tá na scoileanna faoi réir ag na hAchtanna um Stadás Comhionann 2000-2011

source: (Educational establishments in this context refers to preschools, primary, post-primary, an institution providing adult, continuing or further education, a university, third level or higher level institution whether or not they are publicly funded.) You can find an information booklet about Schools and the Equal Status Acts (pdf) on the Department of Education and Skills website
ga: (Ciallaíonn bunachas oideachais i gcomhthéacs seo naíonra, bunscoil nó iar-bhunscoil, foras a sholáthraíonn oideachas aosach, oideachas leanúnach nó breisoideachas, nó ollscoil nó aon fhoras tríú leibhéal nó ardleibhéil eile, cibé acu atá sé á chothú ag cistí poiblí nó nach bhfuil.) Tá leabhrán eolais faoi Scoileanna agus na hAchtanna um Stadás Comhionann (pdf) ar an suíomh gréasáin na Roinne Oideachais agus Scileanna

source: Under Section 7 of the Equal Status Act 2000 denominational schools are permitted to refuse to admit non co-religionists in certain circumstances
ga: De réir Alt 7 den Acht um Stadás Comhionann tá cead ag scoileanna sainchreidimh i gcásanna áirid diúltú do dhaltaí nach den chreideamh céanna iad teacht isteach sa scoil
